Pandas is a Python library used for data manipulation and analysis. It provides data structures and operations for working with numerical tables and time series. The name "Pandas" is derived from "Panel Data" and "Python Data Analysis". 
> Series - 1D
> DataFrame - 2D

In [1]:
!pip install pandas

Looking in indexes: https://artifactory.airbus.corp/artifactory/api/pypi/r-airbus-pypi-virtual/simple
Collecting pandas
  Downloading https://artifactory.airbus.corp/artifactory/api/pypi/r-airbus-pypi-virtual/packages/packages/31/9e/6ebb433de864a6cd45716af52a4d7a8c3c9aaf3a98368e61db9e69e69a9c/pandas-2.2.3-cp310-cp310-win_amd64.whl (11.6 MB)
     ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
      --------------------------------------- 0.2/11.6 MB ? eta -:--:--
      --------------------------------------- 0.2/11.6 MB ? eta -:--:--
      --------------------------------------- 0.2/11.6 MB ? eta -:--:--
     -- ------------------------------------- 0.8/11.6 MB 4.4 MB/s eta 0:00:03
     -- ------------------------------------- 0.8/11.6 MB 4.4 MB/s eta 0:00:03
     -- ------------------------------------- 0.8/11.6 MB 4.4 MB/s eta 0:00:03
     -- ------------------------------------- 0.8/11.6 MB 2.6 MB/s eta 0:00:05
     ------ --------------------------------- 1.8/11.6 MB 5.3 MB/s eta 0:00:02
     ------ --------------------------------- 1.8/11.6 MB 5.3 MB/s eta 0:00:02
     ------ --------------------------------- 1.8/11.6 MB 5.3 MB/s eta 0:00:02
     ------------ --------------------------- 3.7/11.6 MB 7.2 MB/s eta 0:00:02
     ------------- -------------------------- 3.9/11.6 MB 7.6 MB/s eta 0:00:02
     ------------- -------------------------- 3.9/11.6 MB 7.6 MB/s eta 0:00:02
     -------------- ------------------------- 4.2/11.6 MB 6.5 MB/s eta 0:00:02
     --------------------------- ------------ 8.1/11.6 MB 11.5 MB/s eta 0:00:01
     ---------------------------- ----------- 8.2/11.6 MB 11.6 MB/s eta 0:00:01
     ---------------------------- ----------- 8.2/11.6 MB 11.6 MB/s eta 0:00:01
     ----------------------------------- --- 10.5/11.6 MB 14.9 MB/s eta 0:00:01
     --------------------------------------  11.6/11.6 MB 19.8 MB/s eta 0:00:01
     --------------------------------------- 11.6/11.6 MB 18.2 MB/s eta 0:00:00
Collecting pytz>=2020.1
  Downloading https://artifactory.airbus.corp/artifactory/api/pypi/r-airbus-pypi-virtual/packages/packages/81/c4/34e93fe5f5429d7570ec1fa436f1986fb1f00c3e0f43a589fe2bbcd22c3f/pytz-2025.2-py2.py3-none-any.whl (509 kB)
     ---------------------------------------- 0.0/509.2 kB ? eta -:--:--
     ------------------------------------- 509.2/509.2 kB 31.2 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.22.4 in c:\users\spanbagv\appdata\local\miniforge3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\spanbagv\appdata\local\miniforge3\lib\site-packages (from pandas) (2.9.0.post0)
Collecting tzdata>=2022.7
  Downloading https://artifactory.airbus.corp/artifactory/api/pypi/r-airbus-pypi-virtual/packages/packages/5c/23/c7abc0ca0a1526a0774eca151daeb8de62ec457e77262b66b359c3c7679e/tzdata-2025.2-py2.py3-none-any.whl (347 kB)
     ---------------------------------------- 0.0/347.8 kB ? eta -:--:--
     ------------------------------------- 347.8/347.8 kB 21.1 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\spanbagv\appdata\local\miniforge3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2

In [2]:
import pandas as pd

In [3]:
# SERIES - It is a 1D array like object wihivh can hold any data type 
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
# create a series from dictionary elements
data_dict ={'a':1,'b':2,'c':3}
series_dict = pd.Series(data_dict)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [7]:
# Creating custum indexes
data_ind = [10,20,30]
ind = ['a','b','c']
pd.Series(data_ind,index=ind)

a    10
b    20
c    30
dtype: int64

In [9]:
#### DATA FRAME = 2D tabular structure 
# Create a dataframe from dictionary of list

sample_data = {
    'Name':['Krish','Rajat','Shreya'],
    'Age' :[10,20,30],
    'City':['Bangalore','Chicago','Texas']
}

df = pd.DataFrame(sample_data)
print(df)

     Name  Age       City
0   Krish   10  Bangalore
1   Rajat   20    Chicago
2  Shreya   30      Texas

In [10]:
# Creating dataframe from a list of dictionary
sample_list = [
    {'Name':'Shreyasi','Age':23,'City':'Bangalore'},
    {'Name':'Shrey','Age':23,'City':'Bangalore'},
    {'Name':'Shreya','Age':23,'City':'Bangalore'},
    {'Name':'Shreyasi','Age':23,'City':'Bangalore'},
    {'Name':'Shresi','Age':23,'City':'Bangalore'},
]

df = pd.DataFrame(sample_list)
print(df)

       Name  Age       City
0  Shreyasi   23  Bangalore
1     Shrey   23  Bangalore
2    Shreya   23  Bangalore
3  Shreyasi   23  Bangalore
4    Shresi   23  Bangalore

In [13]:
#Reading from a Csv file
df = pd.read_csv('Practice.csv')
#top 5 elements
df.head(10)
# last elements
df.tail(5)

,Calendar Month-Year,Financial Product,Location CC Grp.,Section,Stage,Quantity
383,12-25,A350-1000,Airbus Aerostructure,WUC,6,386
384,12-25,A350-1000,PI,WUC,7,387
385,12-25,A350F,Airbus Aerostructure,WUC,4,388
386,12-25,A350F,Airbus Aerostructure,WUC,6,389
387,12-25,A350F,PI,WUC,7,390

In [14]:
# Accessing data from dataframe
sample_data = {
    'Name':['Krish','Rajat','Shreya'],
    'Age' :[10,20,30],
    'City':['Bangalore','Chicago','Texas']
}

df = pd.DataFrame(sample_data)
print(df)

     Name  Age       City
0   Krish   10  Bangalore
1   Rajat   20    Chicago
2  Shreya   30      Texas

In [18]:
# Pickup only name column
df['Name']
type(df['Name'])  # It will be series
df.loc[0] # for row index

Name        Krish
Age            10
City    Bangalore
Name: 0, dtype: object

In [23]:
df.iloc[0] # for column index

NameError: name 'ser' is not defined

In [24]:
df['Name']

0     Krish
1     Rajat
2    Shreya
Name: Name, dtype: object

In [25]:
df.at[1,'Age']

np.int64(20)

In [28]:
df.iat[2,2]

'Texas'

In [29]:
# data manipulation with DF
df['Salary'] = [4000,6000,7000] # add column
print(df)

     Name  Age       City  Salary
0   Krish   10  Bangalore    4000
1   Rajat   20    Chicago    6000
2  Shreya   30      Texas    7000

In [30]:
df.drop('Salary',axis = 1, inplace=True) # inplace --for permanent drop otherwise temp drop
df # axis to check column wise as well

     Name  Age       City
0   Krish   10  Bangalore
1   Rajat   20    Chicago
2  Shreya   30      Texas

In [31]:
df['Age'] = df['Age']+1
df

     Name  Age       City
0   Krish   11  Bangalore
1   Rajat   21    Chicago
2  Shreya   31      Texas

In [32]:
data=pd.read_csv('Practice.csv')
data.describe()

            Stage    Quantity
count  388.000000  388.000000
mean     5.670103  196.500000
std      1.249055  112.150197
min      4.000000    3.000000
25%      4.000000   99.750000
50%      6.000000  196.500000
75%      7.000000  293.250000
max      7.000000  390.000000